/**
 * Значения коэффицентов и корней для формул Гаусса
 */
const Table = {
    "2": [
        [1.0, -0.577350269189626],
        [1.0, 0.577350269189626]
    ],
    "3": [
        [0.888888888888889, 0.000000000000000],
        [0.555555555555556, -0.774596669241483],
        [0.555555555555556, 0.774596669241483]
    ],
    "4": [
        [0.652145154862546, -0.339981043584856],
        [0.652145154862546, 0.339981043584856],
        [0.347854845137454, -0.861136311594053],
        [0.347854845137454, 0.861136311594053],
    ],
    "5": [
        [0.568888888888889, 0.000000000000000],
        [0.478628670499367, -0.538469310105683],
        [0.478628670499367, 0.538469310105683],
        [0.236926885056189, -0.906179845938664],
        [0.236926885056189, 0.906179845938664],
    ],
    "6": [
        [0.360761573048139, 0.661209386466264],
        [0.360761573048139, -0.661209386466264],
        [0.467913934572691, -0.238619186083197],
        [0.467913934572691, 0.238619186083197],
        [0.171324492379170, -0.932469514203152],
        [0.171324492379170, 0.932469514203152],
    ],
    "7": [
        [0.417959183673469, 0.000000000000000],
        [0.381830050505119, 0.405845151377397],
        [0.381830050505119, -0.405845151377397],
        [0.279705391489277, -0.741531185599394],
        [0.279705391489277, 0.741531185599394],
        [0.129484966168870, -0.949107912342758],
        [0.129484966168870, 0.949107912342758],
    ]


};
/**
 * Вычисляет интеграл с помощью квадратур гаусса
 * @param {Function} fn функция
 * @param {Number} a левая граница
 * @param {Number} b правая граница
 * @param {Number} n количество точек
 * @returns 
 */
function integrate(fn, a, b, n) {
    let result = 0;
    const q = Table[n];
    for (let i = 0; i < n; i++) {
        let w = q[i][0]
        let z = q[i][1]
        result += w * fn(((b - a) * z + b + a) / 2)
    }
    return result * ((b - a) / 2);
}

/**
 * Округляет число до конректного знака после запятой
 * @param {Number} number число
 * @param {Number} digits количество знаков после запятой
 * @returns 
 */
function round(number, digits) {
    if (digits === 0) {
        return number;
    }
    let d = Math.pow(10, digits);
    return Math.round((number + Number.EPSILON) * d) / d
}


export {
    Table,
    integrate,
    round,
}